-- Сформировать запрос для получения числа на ФКТИУ троечников

WITH ЛЮДИ_С_ПЛОХИМИ_ОЦЕНКАМИ AS (
    SELECT DISTINCT ЧЛВК_ИД
    FROM Н_ВЕДОМОСТИ
    WHERE ОЦЕНКА IN (
        '2',
        'незач',
        'неявка'
    )
)

SELECT COUNT(DISTINCT Н_УЧЕНИКИ.ЧЛВК_ИД) FROM Н_УЧЕНИКИ
    INNER JOIN Н_ПЛАНЫ ON Н_УЧЕНИКИ.ПЛАН_ИД = Н_ПЛАНЫ.ИД
    INNER JOIN Н_ОТДЕЛЫ ON Н_ПЛАНЫ.ОТД_ИД = Н_ОТДЕЛЫ.ИД
    INNER JOIN Н_ВЕДОМОСТИ ON Н_ВЕДОМОСТИ.ЧЛВК_ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
    WHERE 
        Н_ОТДЕЛЫ.КОРОТКОЕ_ИМЯ = 'КТиУ'
        AND Н_ВЕДОМОСТИ.ОЦЕНКА = '3'
        AND Н_УЧЕНИКИ.ЧЛВК_ИД NOT IN (
            SELECT ЧЛВК_ИД
            FROM ЛЮДИ_С_ПЛОХИМИ_ОЦЕНКАМИ
);